[
    {
        "Title": "Shifu Educational Globe for Kids with 1000+ Facts on Animals, Places, Monuments and More - Orboot Earth Augmented Reality Based Fun Learning, Interactive Game ( 4-10 Years)",
        "Price": "1,658",
        "About_This_Item": "About this item\nSpark Curiosity & Learning: Bring the world to life with augmented reality! Explore diverse cultures, fascinating animals, and global wonders with over 1000 facts and interactive games. Perfect for early learners and budding STEM enthusiasts\nBoost Essential Skills: Develop key skills in geography, problem-solving, and memory through engaging AR activities and quizzes. This educational toy is ideal for children aged 4-10, fostering a love for discovery and learning\nHands-On Exploration: Encourage hands-on discovery with PlayShifu's Interactive Globe - Orboot Earth. It's perfect for use in homeschool settings and classrooms, promoting active learning\nPassport to Adventure: Collect fun stickers and 'travel' the world with the included passport. This unique learning experience sparks imagination and supports an early learning journey\nMore Than a Globe: Enjoy interactive globe games, quizzes, and activities that keep kids engaged for years. It's a valuable STEM toy that supports early learning and lasting developmental growth\nInside the Box: The box includes a 10” globe, passport, stamps, country flag stickers, and a detailed help guide. The device is not included, but the app is free to download for interactive fun\nAR Adventure Anywhere: Download the free Orboot app on your device to unlock an AR adventure. It's compatible with iPad mini 4+, iPads (5th gen & above, including all Air, Pro, and Mini 2+), iPhones (7 & above), and Android devices with 3GB RAM or higher. Note: Not compatible with Amazon Fire devices\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "PlayShifu Plugo Count AR-Powered Math STEM Toy with Numbers and Arithmetic Operators for Kids - 250+ Story-Based Interactive Math Challenges Fun Learning, Interactive Game (4-10 Years)",
        "Price": "1,267",
        "About_This_Item": "About this item\nPLUGO COUNT is an AR-powered STEM gaming kit. It turns your device into a hands-on learning system and takes your kids through a series of story-based challenges that need to be solved with a combination of numbers and arithmetic operators (math manipulatives). Watch the video to catch it in action!\nAGES 4-10 - Plugo app has 5 free STEM games for Count, with 250+ progressive levels. Select your child's grade to adjust the difficulty of the games. Kids indulge in various story-based math activities solving word problems, math puzzles, timed trials, and arithmetic questions.\nSpark STEM skills - Plugo Count triggers auditory, visual, and tactile senses in kids and spurs their comprehension abilities, critical thinking, logical reasoning, and mathematical intelligence. It is the perfect gift for kids who love numbers, or for those who havn't fallen in love with Maths yet! Kids practice counting, sequences & patterns, place value, comparison, addition, subtraction, multiplication and division.\nIN THE BOX - Plugo Count comes with 1 foldable gamepad, 1 Count Spike, 4 arithmetic operators (+ - x/), and 2 sets of digits 0-9. No Bluetooth and no electronics. The gamepad and Count Spike connect through embedded magnets. A help guide with step-by-step instructions is also included.\nCOMPATIBLE DEVICES - iOS - iPad 5th gen or newer, all models of iPad Pro (except Pro 12.9\"), all models of iPad Air, iPad Mini 2nd gen or newer, iPhone 6 or newer | Samsung devices: 2015 and newer, 2GB RAM and above [Samsung Tab A7, A 10.5, S7 and S7+ not supported] | Amazon - Fire 7 (9th gen 2019 release only), Fire 8 (8th gen 2018 release, 10th gen 2020 release); [Fire 10 not supported]\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "PlayShifu Singing & Talking Smart Peppa for Ages 3+ - Peppa Pig Soft & Cuddly Plush | Unlimited Content | Bedtime Stories | Sing-Along Stories | Pretend Play | Bluetooth connectivity",
        "Price": "3,208",
        "About_This_Item": "About this item\nPEPPA PIG by PLAYSHIFU Interactive plush toy for ages 3+. Engage with loads of popular content pieces from the hit series, including stories, songs, and more!\nIN THE BOX - Peppa plush with an in-built speaker, Bag, Charger, Guide\nDUAL MODES - With the Offline Mode, your child can play with the Peppa plush straight out of the box; the plush comes preloaded with stories, songs, and fun interactions (giggle, grunt, and more with Peppa in the exclusive ‘Interact with Peppa’ mode). Slide the power switch to turn Peppa on and follow her instructions for unlimited playtime! In Bluetooth Mode, you can connect Peppa to your device and get access to all her content and cool features with the free app.\nFREE CONTENT UPDATES - Enjoy new content that is updated periodically absolutely free!\nKEY SKILLS - Sparks creativity and imagination, builds vocabulary, boosts memory, and encourages pretend play\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Plugo Letters - AR-Powered STEM Word Building Kit for Kids (4-10 Years) - Educational Spelling, Vocabulary and Grammar Game - Fun Interactive Learning Toy, Birthday Gift for Boys and Girls",
        "Price": "2,548",
        "About_This_Item": "About this item\nPLUGO LETTERS is an AR-powered word building kit that combines the goodness of hands-on learning and healthy screen-time. Spell with alphabet tiles, grow your vocabulary, and improve grammar with story-based games. Watch the video to catch it in action\nSTEM, STEAM & everything in between - sharpen your linguistic, reading, comprehension, cognitive, and motor skills. Learn spellings through phonics (ABCs), word usage in sentences, grammar, and language concepts like nouns, verbs, tenses, etc\nAGES 4-10 - Plugo app has 5 interactive games and 250+ levels that make learning super fun (no in-app purchases). More importantly, the app adapts these games to the childâ??s grade from pre-K to 4 for a progressive educational journey\nThis Device is Compatible with 1. iOS - iPad 5th gen or newer, all models of iPad Pro (except Pro 12.9\"), all models of iPad Air, iPad Mini 2nd gen or newer, iPhone 6 or newer. 2. Android devices: 2015 and newer, 2GB RAM and above| Amazon - Fire 7 (9th gen 2019 release only), Fire 8 (8th gen 2018 release, 10th gen 2020 release);Please refer the last image for further information on compatible devices.\nIN THE BOX - The kit contains a Letters Trunk and 48 letter tiles. Spell with tiles on the Trunk, and put them all inside to store away. It comes with the Plugo gamepad, a foldable mat with embedded magnets to hold the Plugo kit on one side, and your device goes in the slot on the other side. Hands-on learning without touching the screen!",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu ZeeZee The Smart Storyteller - Singing & Talking Unicorn Friend Soft Toys for Kids Unlimited Content on The App Rhymes Stories Pretend Play Birthday Gifts for Boys and Girls Ages 3, 4, 5, 6",
        "Price": "2,597",
        "About_This_Item": "About this item\nMeet ZeeZee! Your Storytelling Buddy: An interactive unicorn plush toy for kids aged 3+\nWhat’s Inside the Box: Includes a plush unicorn with an integrated speaker, eye mask, comb, USB charger, and guidebook\nTwo Fun Modes: Offline Mode with built-in stories, rhymes, and games; Bluetooth Mode unlocks even more content through the Lovabies app\nFree Updates, Always: Get new stories and activities every two weeks for free!\nDevelop Essential Skills: Encourages creativity, builds language, strengthens memory, and promotes imaginative role-play\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Plugo 3 in 1 Pack AR-Powered Math Toy on Math, Problem Solving and Linguistics for Kids - STEM Kit with 15 Interactive Games and 750+ Fun Learning Levels (4-10 Years)",
        "Price": "4,247",
        "About_This_Item": "About this item\nPlayShifu PLUGO 3-in-1 pack combines the goodness of three AR-powered STEM kits - Plugo Count to learn math, Plugo Letters to spell and learn new words, and Plugo Link to solve puzzles with magnetic blocks. Hands-on learning and healthy screen-time guaranteed with story-based challenges. Watch the video to catch them all in action!\nAGES 4-10 - Plugo app has 15 interactive games and 750+ levels that make learning super fun (no in-app purchases). More importantly, the app adapts these games to the child’s grade from pre-K to Grade 4 for a progressive educational journey.; STEAM & everything in between - sharpen your counting, arithmetic, linguistic, comprehension, problem-solving, and fine-motor skiklls. The Plugo 3-in-1 pack works to spark STEAM skills, especially math, engineering and linguistic abilities.\nIN THE BOX - The pack contains 3 Plugo kits (Count, Link, and Letters) and 1 Plugo Gamepad. The gamepad is a foldable mat that holds your device goes in the slot on one side. It has a play area on the other side with embedded magnets to place and play with the Plugo kits one-by-one. Download the Plugo app from App Store or Play Store for free and get started (The box doesn’t come with a tablet/smartphone).\nCOMPATIBLE DEVICES - iOS - iPad 5th gen or newer, all models of iPad Pro (except Pro 12.9\"), all models of iPad Air, iPad Mini 2nd gen or newer, iPhone 6 or newer | Android devices: 2015 and newer, 2GB RAM and above [Samsung Tab A7, S7 and S7+ not supported] | Amazon - Fire 7 (9th gen 2019 release only), Fire 8 (8th gen 2018 release, 10th gen 2020 release); [Fire 10 not supported]\nUnit Count: 1; Item Type Name: Educational Toys\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Plugo STEM Wiz Pack AR-Powered Toy with Count and Link Kit for Kids - Math Puzzles Challenges Fun Learning, Interactive Game (4-10 Years)",
        "Price": "3,599",
        "About_This_Item": "About this item\nThe kit includes a gamepad (works with all Plugo kits), 15 hexagonal building blocks (for Link), and a set of operators, numbers and count spike (for Count). A help guide with step-by-step instructions is also included\nPlugo app (one app for both Link and Count) has 8 interactive games with age-adaptive progressive levels. Solve math puzzles, word problems, build gravity-defying structures, and many other fun STEAM/STEM activities\nCOMPATIBILITY | Plugo app works with all 5 Plugo kits (no in-app purchases): Apple devices: iPad 5th gen & above, iPad Mini 2 & above, iPad Air all models, iPad Pro all models (except Pro 12\"), iPhone 6 & above | Samsung devices: 2015 and newer, 2GB RAM and above [except Samsung Tab A7 (SM-T500)] | Amazon Fire devices: Fire 7 (9th gen 2019 release) | Fire 8 (8th gen - 2018 release, 10th gen - 2020 release); [Fire 10 not supported]\nPlugo games trigger auditory, visual, and tactile senses in kids. The games spur their creativity, critical thinking, reasoning abilities, mathematical and spatial intelligence. It is a gift your kids will fall in love with instantly!; Toys and Games\nItem Type Name: Augmented Reality Based Educational Toys; Age Range Description: 4 Years And Above\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "PlayShifu Safari 60 Animal Flashcards for Kids - 4D Educational iOS and Android Augmented Reality Based Fun Learning, Interactive Game ( 2-10 years, Multicolor)",
        "Price": "674",
        "About_This_Item": "About this item\nToys and Games\nShifu Safari is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Safari innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Safari box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nWhat it brings home: A real life experience of animals in their habitat, food they eat, distinctive sounds they make and their unique actions. It is bound to bring a smile on your child’s face!\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Play 20 Underwater Animals Flashcards for Kids - Boost Problem Solving Skills with 4D Educational Ar-Powered Stem Fun Learning, Interactive Game (2-5 Years, Green)",
        "Price": "423",
        "About_This_Item": "About this item\nMARINE ANIMALS FLASHCARDS for kids ages 2-5. AR-powered puzzle flashcards!\nIN THE BOX - 20 Jigsaw flashcards, 1 Device stand, 1 Instructions sheet\n5-IN-1 - AR flashcards (scan and learn), spelling games, facts, quiz, jigsaw puzzle\nBUILD SEA VOCABULARY & GK - Discover new animals, their sounds, and diet\nDEVELOPS pattern recognition, improves hand-eye coordination, strengthens problem-solving skills\n› See more product details",
        "Product_Description": "Learn all about marine animals with 20 flashcards. Use the free mobile app to scan the animal on the flashcard, and watch as they come to life on your screen! Learned all about the animals? Assemble the jigsaw flashcards to complete the underwater puzzle!"
    },
    {
        "Title": "PlayShifu-Plugo Count Without Gamepad -Math Games with Stories for 4-10 Years - STEM Toy (Works with iPads, iPhones, Samsung Tablets/Phones, Fire Tablets)",
        "Price": "1,574",
        "About_This_Item": "About this item\nPLUGO COUNT is an AR-powered STEM gaming kit. It turns your device into a hands-on learning system and takes your kids through a series of story-based challenges that need to be solved with a combination of numbers and arithmetic operators (math manipulatives). Watch the video to catch it in action!\nAGES 4-10 - Plugo app has 5 free STEM games for Count, with 250+ progressive levels. Select your child's grade to adjust the difficulty of the games. Kids indulge in various story-based math activities solving word problems, math puzzles, timed trials, and arithmetic questions.\nSpark STEM skills - Plugo Count triggers auditory, visual, and tactile senses in kids and spurs their comprehension abilities, critical thinking, logical reasoning, and mathematical intelligence. It is the perfect gift for kids who love numbers, or for those who havn't fallen in love with Maths yet! Kids practice counting, sequences & patterns, place value, comparison, addition, subtraction, multiplication and division\nIN THE BOX - Plugo Count comes with 1 Count Spike, 4 arithmetic operators (+ - x/), and 2 sets of digits 0-9. No Bluetooth and no electronics. The gamepad and Count Spike connect through embedded magnets. A help guide with step-by-step instructions is also included.\nCOMPATIBLE DEVICES - iOS - iPad 5th gen or newer, all models of iPad Pro (except Pro 12.9\"), all models of iPad Air, iPad Mini 2nd gen or newer, iPhone 6 or newer | Samsung devices: 2015 and newer, 2GB RAM and above [Samsung Tab A7, A 10.5, S7 and S7+ not supported] | Amazon - Fire 7 (9th gen 2019 release only), Fire 8 (8th gen 2018 release, 10th gen 2020 release); [Fire 10 not supported\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Playshifu 20 Space Flashcards with Space Quest for Kids - Boost General Knowledge, Builds Vocabulary with 4D Educational AR-Powered STEM Fun Learning, Interactive Game (2-5 Years, Blue)",
        "Price": "398",
        "About_This_Item": "About this item\nSPACE FLASHCARDS for kids ages 2-5. AR-powered puzzle flashcards!\nIN THE BOX - 20 Jigsaw flashcards, 1 Device stand, 1 Instructions sheet\n5-IN-1 - AR flashcards (scan and learn), spelling games, facts, trivia, jigsaw puzzle\nBOOSTS general knowledge, improves hand-eye coordination, builds vocabulary\nFALL IN LOVE with science!\n› See more product details",
        "Product_Description": "Learn all about space with 20 flashcards. Use the free mobile app to scan the image on the flashcard, and watch as outer space comes to life on your screen! Learned all about space? Assemble the jigsaw flashcards to complete the space puzzle!"
    },
    {
        "Title": "PlayShifu Plugo Learners Pack AR-Powered STEM Toys for Kids - Math Learning Kit and Alphabet Tiles Game Set with 15 Interactive Games and 500+ Fun Learning Levels (4-10 Years)",
        "Price": "3,599",
        "About_This_Item": "About this item\nPlugo Learners pack, a super-saver bundle of PlayShifu’s two bestselling S.T.E.A.M.-based learning toys for girls and boys. Plugo Count: a math toy for kids 4-10 years old, and Plugo Letters: a word-building and grammar kit.\n📦IN THE BOX: This kids’ toys kit includes a gamepad (that works with all Plugo kits), 1 Plugo Count kit: 4 math operators (+ – ÷ ×), two sets of 0-9 digits and a toy base, 1 Plugo Letters kit: 1 Letters Trunk, and 48 Letter Tiles. Both the game sets come with instructional guides.\n🎮FUN GAMES WITH PLUGO APP - Plugo app (one app for both Count and Letters) has 14 interactive games with 500+ age-adaptive levels. Makes it a great STEM toy for kids upto 10 years old. Solve fun math puzzles and play word-building games to develop foundational skills like numeracy and arithmetic, and vocabulary and grammar.\n📱COMPATIBILITY | Plugo app works with all 5 Plugo kits (no in-app purchases): Apple devices: iPad 5th gen & above, iPad Mini 2 & above, iPad Air all models, iPad Pro all models (except Pro 12\"), iPhone 6 & above | Samsung devices: 2015 and newer, 2GB RAM and above [except Samsung Tab A7 (SM-T500)] | Amazon Fire devices: Fire 7 (9th gen 2019 release) | Fire 8 (8th gen - 2018 release, 10th gen - 2020 release); [Fire 10 not supported]\n🎓STEAM LEARNING MADE FUN - Plugo games trigger auditory, visual, and tactile senses in kids. The games spur their creativity, critical thinking, reasoning abilities, language comprehension, and mathematical and spatial intelligence. It is a gift for boys and girls that they will fall in love with instantly!\n› See more product details",
        "Product_Description": "Word Building & Math Learning kit"
    },
    {
        "Title": "Shifu Tacto Laser - AR-Powered STEM Toy for Kids Age (4-10 Years) - Master The Physics of Light, Boost Critical Thinking Skills with Interactive Puzzles - Ideal Birthday Gift for Boys and Girls",
        "Price": "1,799",
        "About_This_Item": "About this item\nTACTO LASER by PlayShifu turns your tablet into an interactive board game, based on physics of Light! Solve thrilling mysteries by lighting up the clues! Strategically choose your figurine to cross the obstacles. Use flashlight and mirror figurines on screen to light up the target. Split light into 7 colors with the prism figurine and use a color to solve puzzles.\nSTEM learning just got super fun with brain-teasing and story-based logic games! Boost problem-solving skills and develop logical reasoning and critical thinking with creative play. Turn your tablet into an interactive board game! Use tactile figurines to drive the games on screen.\nFOR AGES 5-10 - for this game set, Tacto app has 4 different story-based games with 200+ challenges that become increasingly difficult as you play. Download the Tacto app from App Store or Play Store to get started (no in-app purchases, works without internet).; IN THE BOX - 2 frames and 4 game pieces (1 mirror figurine, 1 prism figurine, 1 flashlight figurine, 1 laser figurine). Fix the 2 anti-slip frames on either side of your tablet. Choose a game and let the adventure begin! (The box doesn’t come with a tablet/smartphone).\nCOMPATIBLE DEVICES: Tacto works with a range of tablets: iPad 5th gen and above (iPad 2 and iPad Mini 1 not supported) Android tabs 7-inches and above, minimum 2GB RAM (Samsung Tab A and S7+ not supported), Fire HD 10 - 2021 (Fire 7 not supported). Tacto app is absolutely free to download from the Apple App Store or Google Play Store and works even without the internet (no ads or in-app purchases).\nUnit Count: 1; Item Type Name: Tacto Laser Toy; Unit Count Type: Count; Age Range Description: 5-10 Years\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Plugo Link - Magnetic Building Blocks Kit With Stem Puzzles For Kids Ages 4-10 Year (App Based, Device Not Included) Yellow,Pack Of 1",
        "Price": "2,547",
        "About_This_Item": "About this item\nPLUGO LINK (Part of Shifu plugo) is an AR-powered STEM gaming kit. It transforms your device into a fun-filled learning system and gives your kids the chance to solve real-world problems and develop their engineering skills. Plugo Link is suitable for kids 5 to 10 years of age.\nIN THE BOX - Plugo Link comes with a foldable gamepad and 15 hexagonal building blocks. No Bluetooth and no electronics. The hexagons and the gamepad connect using embedded magnets. A help guide with step-by-step instructions is also included.; PLUGO APP - download the free Plugo app and play 5 games with 250+ progressive levels. The games are designed to suit the learning needs of kids as per their age.\nSpark STEM skills - Plugo Link is designed to spur the essential elements of STEM curriculum such as creativity, critical thinking, reasoning abilities, and spatial intelligence in kids. It is a gift your kids will fall in love with instantly.\nSize Name: Standard; Item Type Name: Augmented Reality Based Educational Toys; Size Name: Standard; Item Type Name: Augmented Reality Based Educational Toys\nSize Name: Standard; Item Type Name: Augmented Reality Based Educational Toys\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "PlayShifu 60 Vehicle Flashcards for Kids - 4D Educational iOS and Android Travel Augmented Reality Based Fun Learning, Interactive Game ( 2-10 years, Blue)",
        "Price": "635",
        "About_This_Item": "About this item\nToys and Games\nShifu Travel is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Travel innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Travel box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nWhat it brings home: A real life experience of vehicles - means of transport, purpose of each vehicle, how they move and the sounds they make. It is bound to bring a smile on your child’s face!\nSee your child progress: Shifu promotes imagination, self- learning, and creativity. Enhances motor skills. Improves vocabulary through a fun game of learning spellings and correct pronunciations.\n› See more product details",
        "Product_Description": "Shifu creates an innovative and immersive learning experience during play time by bringing board games and mobile devices together through Augmented Reality. Shifu App can be downloaded for FREE from the Google Play Store or Apple App Store. For Android & Apple mobiles & tablets - 1 GB RAM | Android OS 4.4 & above | iOS 8.0 & above. Wi-Fi required only for installation and one-time setup, not after that. No Bluetooth required. No in-app purchases or ads. All materials used are child-safe. Changing The Way Kids Play & Learn Shifu gives a 4-dimensional play experience to your child that is interactive and educational. Combines physical & digital worlds through Augmented Reality, you just have to pair the cards with FREE Shifu App and let the magic unfold! Try a Demo on your device now! Go The Extra Mile Visualize the various modes of transport right on your mobile screen! Shifu Travel has 60 Vehicle cards for a fun & learning play time. It includes all types of vehicles – personal, commercial, industrial and special purpose – covering all mediums of land, water and air. Purpose of each Vehicle Learn about all the vehicles in the world - how does it look and what is it used for! Activities & Puzzles Play fun and engaging puzzles and build-your-own activities with each vehicle. Fun Spelling Game Stretch your vocabulary through fun Spelling & Pronunciation game. Shifu’s Favourite 60 Vehicles Personal – Bicycle, Bike, Car, Dirt Bike, Fishing Boat, Golf Cart, Hover Board, Jet Pack, Kayak, Quad Bike, Race Car, Scooter, Segway, Tricycle, Unicycle Carriers/Leisure – Aeroplane, Boat, Bus, Cable Car, Cart, Catamaran, Cruise, Electric Train, Elevator, Escalator, Helicopter, Hot Air Balloon, Houseboat, Jeep, Raft, Rickshaw, Sea Plane, Sleigh, Tram, Train, Truck Industrial – Bulldozer, Crane, Dumper Truck, Earth Mover, Forklift, Lorry, Oil Tanker, Trailer Special Purpose – Ambulance, Battleship, Cargo Ship, Chopper, Fighter Plane, Fire Truck, Harvester, Ice Breaker, Life Boat, Rocket, Satellite, Spaceship, Submarine, Tow Truck, Tractor, Warship, War Tank About the Startup Describe your product in 3 words. Revolutionizing Early Learning How did you come up with the idea for this product? We are passionate parents and understood that learning in the early stage is centered around play and entertainment. Being tech enthusiasts as well, we explored Augmented Reality, an upcoming technology, as a promising tool for creating engaging methods of Early Learning. What makes your product special? Since we make products for children of age 2-10 years, malleable beings in their most formative years, we have done exhaustible research and have put tremendous thought into every single detail while making the game. We constantly strive to update our products regularly to attain perfection! What has been the best part of your startup experience? The amazement and happiness on the faces of kids and parents alike!"
    },
    {
        "Title": "PlayShifu 60 Profession Flashcards for Kids - 4D Educational iOS and Android Jobs Augmented Reality Based Fun Learning, Interactive Game (2-10 Years, Blue)",
        "Price": "674",
        "About_This_Item": "About this item\nToys and Games\nShifu Job is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Job innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Job box contains 60 fun jobs flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nWhat it brings home: A real life experience of people in their workplaces - what do they do and how, their workplace, tools they use and the uniforms they wear to work. It is bound to bring a smile on your child’s face!\nSee your child progress: Shifu promotes imagination, self- learning, and creativity. Enhances motor skills. Improves vocabulary through a fun game of learning spellings and correct pronunciations.\n› See more product details",
        "Product_Description": "Shifu creates an innovative and immersive learning experience during play time by bringing board games and mobile devices together through Augmented Reality. Shifu App can be downloaded for FREE from the Google Play Store or Apple App Store. For Android & Apple mobiles & tablets - 1 GB RAM | Android OS 4.4 & above | iOS 8.0 & above. Wi-Fi required only for installation and one-time setup, not after that. No Bluetooth required. No in-app purchases or ads. All materials used are child-safe. Changing The Way Kids Play & Learn Shifu gives a 4-dimensional play experience to your child that is interactive and educational. Combines physical & digital worlds through Augmented Reality, you just have to pair the cards with FREE Shifu App and let the magic unfold! Try a Demo on your device now! Work Hard Play Harder Watch the various professionals at work right on your mobile screen! Shifu Jobs has 60 Occupation cards for a fun & learning play time. It covers an exhaustive list of the many occupations there are in the world. What they do & Where Know the real life heroes and visualize their workplace! Uniforms & Tools used Learn about various tools they use for their work and what uniforms they wear. Fun Spelling Game Stretch your vocabulary through fun Spelling & Pronunciation game. Shifu’s Favourite 60 Professionals Outdoor – Actor, Astronaut, Astronomer, Athlete, Builder, Director, Diver, Driver, Engineer, Farmer, Fire Fighter, Fisherman, Gardener, Jester, Journalist, Lifeguard, Magician, Musician, Nurse, Paleontologist, Photographer, Pilot, Plumber, Policeman, Politician, Race Car Driver, Referee, Ring Master, Sailor, Singer, Security Guard, Soldier, Zookeeper Indoor – Accountant, Artist, Author, Baker, Banker, Barber, Butcher, Cartoonist, Carpenter, Chef, Chemist, Doctor, Dentist, Designer, Dancer, Disc Jockey, Electrician, Janitor, Judge, Maid, Mechanic, Programmer, Scientist, Surgeon, Tailor, Teacher, Veterinarian About the Startup Describe your product in 3 words. Revolutionizing Early Learning How did you come up with the idea for this product? We are passionate parents and understood that learning in the early stage is centered around play and entertainment. Being tech enthusiasts as well, we explored Augmented Reality, an upcoming technology, as a promising tool for creating engaging methods of Early Learning. What makes your product special? Since we make products for children of age 2-10 years, malleable beings in their most formative years, we have done exhaustible research and have put tremendous thought into every single detail while making the game. We constantly strive to update our products regularly to attain perfection! What has been the best part of your startup experience? The amazement and happiness on the faces of kids and parents alike!"
    },
    {
        "Title": "Shifu Play 20 Wild Animals Flashcards for Kids - Boost Problem Solving Skills with 4D Educational Ar-Powered Stem Fun Learning, Interactive Game (2-5 Years, Green)",
        "Price": "348",
        "About_This_Item": "About this item\nWILD ANIMALS FLASHCARDS for kids ages 2-5. AR-powered puzzle flashcards!\nIN THE BOX - 20 Jigsaw flashcards, 1 Device stand, 1 Instructions sheet\n5-IN-1 - AR flashcards (scan and learn), spelling games, facts, quiz, jigsaw puzzle\nBUILD JUNGLE VOCABULARY & GK - Discover new animals, fruits, and plants\nDEVELOPS pattern recognition, improves hand-eye coordination, strengthens problem-solving skills\n› See more product details",
        "Product_Description": "Learn all about wild animals with 20 flashcards. Use the free mobile app to scan the animal on the flashcard, and watch as they come to life on your screen! Learned all about the animals? Assemble the jigsaw flashcards to complete the wildlife puzzle!"
    },
    {
        "Title": "Shifu Play Plugo Farm by (Kit+App) : Interactive Farm Toys with Ar Barn and Animal Figurines for Kids Age 4+ | Stem Learning & Birthday Gifts for Boys & Girls (Works with Tabs/Mobiles)",
        "Price": "2,899",
        "About_This_Item": "About this item\nPlugo Farm is the world’s first AR farm kit! Build and manage your digital farm using real figurines by working your way through 200+ challenges.\nManage your time between animals, produce, and customers. Nurture your animals and crops, plan your resources, build inventory, and tend to customers to earn heart points.\nPlugo Farm helps early learners strengthen problem-solving and planning skills. It teaches time management and helps children understand value-creation in the real world.\nThe box includes: 1 farm base, 5 crops, 4 animals, 1 tractor (with harvester and tanker attachments), 1 bucket, 1 fodder, 8 flags, 1 manager figurine, and a foldable Gamepad (with magnetic play area).\nCOMPATIBLE DEVICES - iOS - iPad 5th gen or newer, all models of iPad Pro (except Pro 12.9\"), all models of iPad Air, iPad Mini 2nd gen or newer, iPhone 6 or newer | Android - Samsung devices: 2015 and newer, 2GB RAM and above [Samsung Tab A7, A10.5, S7 and S7+ not supported] | Amazon - Fire 7 (9th gen 2019 release only), Fire 8 (8th gen 2018 release, 10th gen 2020 release); [Fire 10 not supported]\n› See more product details",
        "Product_Description": "PlayShifu Educational Farm Toys - Plugo Farm (Kit + App) Interactive Educational Toy with Farm Animals & Barn | Build & Grow Your Farm | Gifts for Boys & Girls 4-10 Years (Works with Mobile / tabs)"
    },
    {
        "Title": "PlayShifu Orboot Earth - Interactive AR Globe for Kids 4-10 | 400 Wonders, 1000+ Facts | No Borders, Names",
        "Price": "",
        "About_This_Item": "About this item\nThe information below is per-pack only\nEXPLORE: Orboot Earth from PlayShifu takes your child on a journey around the world. Scan the globe with the companion app to bring it alive and explore the world beyond countries and capitals. Full of visual storytelling, music, animal facts and voice interactions, world quizzes, globe puzzles and challenges for ages 4-10. (No borders and no names on the globe.)\nLEARN: Explore 400 wonders and 1000+ facts across 6 categories in AR - animals, cultures, monuments, inventions, maps and cuisines of the world. Learn about the food chain and balance the ecosystem of your national park, go on scavenger hunts around the world, and take part in fun quizzes for every category.\nFOR AGES 4-10: A perfect early learning toy for the ever-curious kids that sparks their imagination and curiosity. It helps build world knowledge, geography, environmental science, social science, and cultural sensitivity.\nIN THE BOX: a 10” globe, kiddie passport, stamps, country flag stickers, and a help guide. (Tablet / smartphone not included.) If you are looking for an educational globe and a unique gift, Orboot Earth is the answer! It is also a great homeschooling and a classroom learning supplement.\nCOMPATIBLE DEVICES: This smart globe works with the free Orboot Earth app that can be downloaded from the App Store or Play Store on your device (does not require internet to play). Works with - iPad 5th gen & above, iPad Air all models, iPad Pro All models, iPad Mini 2 & above, iPhone 6 & above; Android tablets and smartphones 3GB RAM and above. Amazon Fire devices are currently not supported.\n› See more product details",
        "Product_Description": ""
    },
    {
        "Title": "Shifu iOS and Android Jobs Augmented Reality Learning Games,Blue (60 Profession Cards) & Shifu Safari : 60 Animal Flashcards | 4D Educational Augmented Reality Based Game",
        "Price": "",
        "About_This_Item": "About this item\nToys and Games\nShifu Job is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Job innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Job box contains 60 fun jobs flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nToys and Games\nShifu Safari is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Safari innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Safari box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu iOS and Android Jobs Augmented Reality Learning Games,Blue (60 Profession Cards) & iOS and Android Travel Augmented Reality Learning Games,Blue (60 Vehicle Cards),for Kid",
        "Price": "635",
        "About_This_Item": "About this item\nToys and Games\nShifu Job is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Job innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Job box contains 60 fun jobs flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nToys and Games\nShifu Travel is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Travel innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Travel box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu iOS and Android Travel Augmented Reality Games,Blue (60 Vehicle Cards) and Orboot: The Educational, Augmented Reality Based Globe | STEM Toy for Boys & Girls Age 4 to 10 Years",
        "Price": "",
        "About_This_Item": "About this item\nToys and Games\nShifu Travel is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Travel innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Travel box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nToys and Games\n► Orboot Globe + app takes your child on an augmented reality based journey around the world. Fun. Interactive. Educational. Learn Geography, History, Environmental Science, and more(No borders and no names on Globe)\n► COMPATIBILITY - Orboot app is free on iOS and Android. Compatible with - iPad 5th gen & above, iPad Air all models, iPad Pro All models, iPad Mini 2 & above, iPhone 6 & above; Android 3GB RAM and above. Amazon Fire devices are currently not supported at the moment.\n► The box comes with a 10” globe, passport, stamps, country flag stickers, and a detailed help guide.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Educational Globe for Kids+iOS and Android Jobs Augmented Reality Learning Games+60 Animal Flashcards - (Set of 3 Toys)",
        "Price": "",
        "About_This_Item": "About this item\nEXPLORE: Orboot Earth from PlayShifu takes your child on a journey around the world. Scan the globe with the companion app to bring it alive and explore the world beyond countries and capitals. Full of visual storytelling, music, animal facts and voice interactions, world quizzes, globe puzzles and challenges for ages 4-10. (No borders and no names on the globe.)\nLEARN: Explore 400 wonders and 1000+ facts across 6 categories in AR - animals, cultures, monuments, inventions, maps and cuisines of the world. Learn about the food chain and balance the ecosystem of your national park, go on scavenger hunts around the world, and take part in fun quizzes for every category.\nFOR AGES 4-10: A perfect early learning toy for the ever-curious kids that sparks their imagination and curiosity. It helps build world knowledge, geography, environmental science, social science, and cultural sensitivity.\nToys and Games\nShifu Job is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Job innovatively combines mobile devices and physical play.\nToys and Games\nShow More",
        "Product_Description": ""
    },
    {
        "Title": "Shifu STEM Toy Math Game - Plugo Count Educational Toy for 4 5 6 7 8 Year Old Birthday Gifts & - Plugo Count Without Gamepad,Multicolor",
        "Price": "",
        "About_This_Item": "About this item\nPLUGO COUNT is an AR-powered STEM gaming kit. It turns your device into a hands-on learning system and takes your kids through a series of story-based challenges that need to be solved with a combination of numbers and arithmetic operators (math manipulatives). Watch the video to catch it in action!\nAGES 4-10 - Plugo app has 5 free STEM games for Count, with 250+ progressive levels. Select your child's grade to adjust the difficulty of the games. Kids indulge in various story-based math activities solving word problems, math puzzles, timed trials, and arithmetic questions.\nSpark STEM skills - Plugo Count triggers auditory, visual, and tactile senses in kids and spurs their comprehension abilities, critical thinking, logical reasoning, and mathematical intelligence. It is the perfect gift for kids who love numbers, or for those who havn't fallen in love with Maths yet! Kids practice counting, sequences & patterns, place value, comparison, addition, subtraction, multiplication and division.\nIN THE BOX - Plugo Count comes with 1 foldable gamepad, 1 Count Spike, 4 arithmetic operators (+ - x/), and 2 sets of digits 0-9. No Bluetooth and no electronics. The gamepad and Count Spike connect through embedded magnets. A help guide with step-by-step instructions is also included.\nPLUGO COUNT (Part of Shifu plugo) is an AR-powered STEM gaming kit. It turns your device into a hands-on learning system and takes your kids through a series of story-based challenges that need to be solved with a combination of numbers and arithmetic operators. Plugo Count is suitable for kids 5 to 10 years of age\nIN THE BOX - Plugo Count comes with 1 Count Spike, 4 arithmetic operators (+ - x/), and 2 sets of digits 0-9. No Bluetooth and no electronics. The gamepad and Count Spike connect through embedded magnets. A help guide with step-by-step instructions is also included\nPLUGO APP - download the free Plugo app and play 5 STEM games with 250+ progressive levels. Select your child's grade to adjust the difficulty of the games. Kids indulge in various story-based math activities solving word problems, timed trials, and arithmetic questions\nSpark STEM skills - Plugo Count triggers auditory, visual, and tactile senses in kids and Spurs their comprehension abilities, critical thinking, logical reasoning, and mathematical intelligence. It is the perfect gift for kids who love numbers!\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu iOS and Android Travel Augmented Reality Learning Games,Blue (60 Vehicle Cards) Safari : 60 Animal Flashcards | 4D Educational Augmented Reality Based Game",
        "Price": "",
        "About_This_Item": "About this item\nToys and Games\nShifu Travel is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Travel innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Travel box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\nToys and Games\nShifu Safari is an interactive game for children of age 2-10 years, ensuring fun and learning at the same time. It works with all Android and iOS devices.\nDesigned by early childhood experts and parents, Shifu Safari innovatively combines mobile devices and physical play.\nWhat you get: Each Shifu Safari box contains 60 fun vehicle flashcards that operate in real-time with the specially built Play Shifu Android/iOS App. Also, the set contains device stand, carry pouch and activation code.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Kids Mandi Hopscotch Game | Jumbo Kids Play Mat (40\" x 108\") | Kith-Kith, Stapu, Langdi, Ekka Dukka, Paandi, Kunte Bille | Unique Balancing Game | Large Size for 3 Years and up",
        "Price": "580",
        "About_This_Item": "About this item\n[Classic Floor Games]: We have the largest Mat size in the Market. Play the classic and educational hopscotch hand in hand game with learning carpets 40 Inches X 108 Inches Use both hands and feet.\n[Durable and Colorful]: Made of cloth, color spray does not fade. The Hopscotch can be wiped with a cloth, easy to clean, and soil- and stain-resistant. Our Hopscotch Mat is made from high-quality Woven materials that can be used indoors or outdoors.\n[Usage]: the game mat board is ready to play outside or inside. The Hands and Feet Positions are provided and everyone can easily Jump on the squares. [Clean]: The soft surface is perfect for homes with kids and pets and ensures that your kid don't get hurt while having fun! Dust and stains on the surface of carpet can be easily removed by vacuuming and spot cleaning.\n[Gifting]: Suit for children above 4 to use. It brings challenging and endless joy with kids and Adults. It's a nice present for Diwali, and birthday.\n[Educational and Play] : Let your child have long lasting fun, enjoyment. It's an amazing balancing game for girls and boys. Our rugs passes CPSC FF1-70, standard for the surface flammability of Mats and rugs.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "GELTILES Freedom- 32 Pcs Of Magnetic Tiles Building Blocks Toys With Storage Box Constructing And Creative Learning Educational Next Generation Multicolor Stem Toy For Kids Age 3+ (32 Pcs Set)",
        "Price": "1,840",
        "About_This_Item": "About this item\n【32 PCS Magnetic Tiles】No limitations to construct. Magnetic tiles have a wide variety of different shapes and translucent colors reflect charming sun light! Building toy for 3+year old boys/girls will create fantastic 2D/3D buildings than you can imagine!!\n【CREATIVE STEM TOY&HAPPY LEARNING】Magnetic tiles set can help children develop in science, technology, architectural design and recognition of colors. Permanent magnet easily to build house, castle, aerobat, rocket and other buildings. Childs aged 3 4 5 6 7 8+ can enjoying the fun of building and learning while playing\n【SAFE&EASY TO BUILD & STORE】GELTILES are made of high-quality and durable ABS material, long-term use and smooth edge without sharpness that will protect kids little hands easy to construct. Parents needn't worry about the safety problem of kids\n【DIY DESIGN&MORE FUN&STRENGTHEN RELATIONSHIP】 Magnetic construct toy can bring child's DIY building achievement. Great GELTILES Keep child's away from iPad/tablet, digital screens obsession to spend quality time with families/friends.3+ and group of kids can feel the happiness and the relationship between children and parents strengthens\n【SUITABLE FOR MANY OCCATIONS&PERFECT GIFT FOR CHILDS】 GELTILES Magnetic tiles are perfect at family, STEM, kindergarten, day care centers, preschool or Junior schools use. Great Festivals ,Birthday, other gifts of building toys for 3+ year old boys girls toddlers can be the best choice. Free to contact us if you have any questions\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Smartivity Human Body Toy for Kids 6-12 Years|Body Organs & Functions|Birthday Gifts for Unisex|DIY Science Toys 6,7,8,9,10,11,12,13,14 Years Old I STEM Building Set Wooden Construction Game,79 Pcs",
        "Price": "828",
        "About_This_Item": "About this item\nACTION-PACKED FUN TIME: Learn about Human Anatomy and Organ Functions with this exciting Realistic Mechanical Model. Our step-by-step instructional manual ensures a deeply engaging DIY experience, perfect for kids to construct and enjoy for hours. Designed for Boys and Girls for ages, 6,7,8,9,10,11,12,13,14 years old\nDEVELOPS KEY SKILLS: Reduce screen time and boost confidence and creativity with 100% screen-free engagement. As kids build their own toys, they learn about the science around us, developing a lifelong love for science.\nFREE PARTS LIFETIME: Enjoy hassle free fun with all parts included, plus a lifetime supply of replacement parts. Easy-to-follow instructions make building a breeze, ensuring uninterrupted playtime.\nMADE FROM SUSTAINABLE WOOD: Made from the highest quality engineered wood, our toys are completely safe for kids and boast long-lasting durability.\nULTIMATE GIFT: Give the gift of entertainment and learning combined. Ideal for birthdays gifts for boys and girls, this makes for a thoughtful present that providing endless hours of enjoyment and learning for kids\nLOVED BY KIDS AND PARENTS WORLDWIDE: Trusted by families in 33+ countries, our toys have received multiple accolades, including STEM org approval, the 2022 Innovative Toy of the Year in the Netherlands, and TOTY 2022 Finalist. Join a global community celebrating STEM education through play.\nAN IIT DELHI ALUMNI VENTURE: Crafted by IIT Delhi alumni and rigorously kid-tested for over 100 hours. Our team brainstorm hundreds of ideas to create the most exciting projects that are also age-appropriate and educational.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Smartivity DIY Interactive Clock with Stationary Organiser for Kids Ages 6-12 | Features an Infinity Calendar | Birthday Gift for Boys&Girls | STEM Educational Toy for 6,7,8,9,10,11,12 Years",
        "Price": "798",
        "About_This_Item": "About this item\nBuild, Learn & Organize – A DIY interactive clock that teaches kids time-telling, daily routines, and organization, making learning both fun and practical.\nSTEM Educational Fun – Encourages problem-solving, creativity, and independent thinking with hands-on construction, perfect for kids aged 8-14.\nInfinity Calendar & 60-Second Challenge – Features a perpetual calendar that works for any year and a fun learning challenge to test time skills.\nPerfect Gift for Kids 8-14 – A unique birthday or holiday gift that combines education and play, ideal for both boys and girls who love creative projects.\nFree Parts Lifetime – Enjoy hassle-free fun with a lifetime supply of replacement parts, ensuring uninterrupted play and learning.\nLoved by Kids & Parents Worldwide – Trusted by families in 30+ countries, Smartivity toys inspire creativity, learning, and hands-on engagement.\nMade from Safe & Sustainable Materials – Crafted from high-quality, child-safe, and eco-friendly materials, ensuring durability and safety.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Smartivity Earth-Sun-Moon Space Toy for Kids 8-10-12-14 Years Old | Interactive 3D Model Kit I Birthday Gift for Boys & Girls | DIY Science Toy for Kids 8,9,10,11,12,13,14 Years",
        "Price": "988",
        "About_This_Item": "About this item\nACTION-PACKED FUN TIME: Learn about Rotation, Revolution, Eclipse with this Interactive Space Game. Our step-by-step instructional manual ensures a deeply engaging DIY experience, perfect for kids to construct and enjoy for hours. Designed for Boys and Girls for ages, 8,9,10,11,12,13,14 years old\nDEVELOPS KEY SKILLS: Reduce screen time and boost confidence and creativity with 100% screen-free engagement. As kids build their own toys, they learn about the science around us, developing a lifelong love for science.\nFREE PARTS LIFETIME: Enjoy hassle free fun with all parts included, plus a lifetime supply of replacement parts. Easy-to-follow instructions make building a breeze, ensuring uninterrupted playtime.\nMADE FROM SUSTAINABLE WOOD: Made from the highest quality engineered wood, our toys are completely safe for kids and boast long-lasting durability.\nULTIMATE GIFT: Give the gift of entertainment and learning combined. Ideal for birthdays gifts for boys and girls, this makes for a thoughtful present that providing endless hours of enjoyment and learning for kids\nLOVED BY KIDS AND PARENTS WORLDWIDE: Trusted by families in 33+ countries, our toys have received multiple accolades, including STEM org approval, the 2022 Innovative Toy of the Year in the Netherlands, and TOTY 2022 Finalist. Join a global community celebrating STEM education through play.\nAN IIT DELHI ALUMNI VENTURE: Crafted by IIT Delhi alumni and rigorously kid-tested for over 100 hours. Our team brainstorm hundreds of ideas to create the most exciting projects that are also age-appropriate and educational.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Butterfly EduFields ButterflyEduFields 10in1 Ultimate Electricity Kit | Science Project Kit | Stem Toys for Kids Age 6-14 Years Boys Girls | Best Birthday Gift Idea",
        "Price": "599",
        "About_This_Item": "About this item\n7️⃣ [10in1 MINI GADGET BUILDING STEM TOY] : Bring out the inner scientist in your child. Build 7 gadgets in home - 1) Mini Vacuum Cleaner, 2) Color mixer, 3) Massager, 4) Table fan, 5) DIY torch light, 6) Water Sprinker and 7) Egg beater.\n🛠️ [EASY TO BUILD, SELF GUIDED PLAY]: Simple 5-10 step assembly with pictorial step by step instruction manual & videos. Of course, it gets even better when building with friends and family :-).\n📈 [STEM SKILLS DEVELOPED]: By assembling these building kits, kids can improve their hand eye coordination, build spatial awareness, develop critical thinking & creative problem solving skills..\n✅ [GOOD QUALITY WOODEN PARTS FOR SAFE PLAY]: Comes with re-usable, multi-purpose, wooden parts that make fixtures & joints easy. All parts are child safety tested, meet & exceed the safety standards. No sharp edges or points & no small parts.\n🎁 [PERFECT STEM GIFT FOR KIDS 5+ YEARS]: It’s a perfect gift idea for every special occasion, whether it's a birthday, Christmas, holidays or just to replace screen time with meaningful play. Make your little one feel excited and cherish a memorable experience l!\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Skillmatics Creative Toy Magnetopia - Design Your City, Interactive Pretend Play Set for Kids, Toddlers, 60+ Magnetic Pieces, Preschool Learning Classic Board Game, Gifts for Unisex Ages 3-7",
        "Price": "1,424",
        "About_This_Item": "About this item\nCREATE YOUR OWN WORLD WITH MAGNETOPIA: Create your own dream city using over 60 magnetic pieces. Decorate the streets, add your favorite places to visit around town, or take your furry friends to the beach! With colorful cars, ice cream parlors, parks, and more, there are endless opportunities to stretch your imagination and creativity!\nINCLUDES: 72+ Magnetic Pieces, Magnetic Board with 9 Jigsaw Pieces, and Instruction Manual\nINTERACTIVE PRETEND PLAY: Start by connecting jigsaw pieces to build the magnetic board. Then, explore the magnetic pieces to design your own dream city by placing the pieces on the board!a\nHIGH-QUALITY & COLORFUL GRAPHICS: Skillmatics Magnetopia offers both high-quality magnetic pieces for lasting play and vibrant, eye-catching graphics that immerse young minds in the world of pretend play.\nINFINITE IMAGINATIVE PLAY: This magnetic set offers high repeatability, providing children with limitless opportunities to stretch their imagination and unleash their creativity!\nCHILD-SAFE: The product is safety certified and the pieces are made from non-toxic, child-friendly materials, ensuring a worry-free experience for little ones.\nDEVELOPS KEY SKILLS: Skillmatics Magnetopia is designed to foster the development of essential skills in young children, including creative thinking, spatial reasoning, decision making and fine motor skills.\nGREAT GIFT: This set is an ideal choice for promoting imaginative screen-free play, making it an excellent gift for children aged 3 to 7.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "ButterflyEduFields Girls Science Kit for Kids Ages 8 9 10 11 12 Years | 150+ Science Experiment Kit | Birthday Gifts for Girls Age 8-10-12-14 | Fun STEM Learning and Educational Toys",
        "Price": "699",
        "About_This_Item": "About this item\n🚀 Exciting STEM Learning – Explore 150+ fun experiments with real lab tools! Safe chemicals, goggles, and creative molds make science exciting for girls 8+.\n🔬 Hands-On & Interactive – Say goodbye to boring learning! This kit makes science fun with engaging DIY activities and cool chemical reactions.\n🛠 High-Quality & Safe – Includes beakers, trays, volcano molds, colors, and more. Durable, safe, and built for endless experiments!\n🎓 Perfect for Learning & Fun – Ideal for science fairs, homeschooling, or just a fun activity at home. Promotes critical thinking and problem-solving!\n🌟 Inspires Creativity & Curiosity – Mix, pour, and experiment! Sparks a lifelong love for science in young girls. Perfect for solo or group fun!\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "PW Curious Jr. Electricity & Magnetism Science Projects Kit for Boys & Girls Aged 8-10-12-14 Years Old | STEM Learning & Educational Toy | Made in India |Educational Learning Kits",
        "Price": "559",
        "About_This_Item": "About this item\n🔬 Fuel Curiosity with Endless Exploration: This comprehensive science kit features over 15 engaging experiments that delve into various scientific principles like Electricity, Magnetism, Circuits, and more. Conduct experiments multiple times to solidify understanding and fuel a passion for discovery.\n🧩 Make Learning Fun and Interactive: Turn complex concepts into engaging activities! This kit breaks down Static electricity, circuits (open & closed), Energy conversion, Conductors and Insulators, Magnetic fields & forces, Electromagnetism, the Heating Effect of electricity, and more into hands-on experiences, fostering a deeper understanding and sparking curiosity about the fascinating world of science.\n🧠 Empower Young Learners: A clear and detailed manual equips young scientists with the knowledge and confidence to navigate each experiment independently. This fosters a sense of accomplishment and encourages self-directed learning.\n🛡️ Safety First, Fun Always: Designed with safety in mind, this kit prioritizes your child's well-being, allowing them to explore and experiment confidently. This ensures a worry-free learning experience for both parents and children.\n🌍 Real-world Applications: Experience the magic of real-world applications as your child explores hands-on activities. Our kit provides practical insights into scientific principles, connecting theoretical knowledge to the tangible world around them.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Butterfly EduFields 100+ Science Kit | Gift for Girls Age 6-7 | Birthday Gift for 5 6 7 8 Year Old Girl | Girls Science Experiment Kit | Toys for 6 Year Old | Fun STEM Learning and Educational Toys",
        "Price": "679",
        "About_This_Item": "About this item\n🚀 Exciting Science Learning: Dive into the world of science with our Butterfly Edufields Girls Science Kit! Designed for ages between 4 and 8, this kit combines fun activities, and experiments, making it an ideal STEM education kit for girls. Let your little scientist explore chemical reactions using safe chemicals, addon tools, and more—all included in the kit. This super science series kit promotes hands-on learning and fosters curiosity about various DIY science experiments.\n🚀 Interactive Learning Experience: Make learning unforgettable with our STEM Kit! With 100+ science experiments, and DIY science activities, your little girls will learn and enjoy various science concepts, and get hands-on experience with our girls science kit! Our science kit for kids is anti-boring, an makes learning science fun for young girls between the ages 4 to 8 years.\n🚀 High-Quality Components: Our Super Science Series Girls Science Kit is crafted with premium materials to ensure durability and safety. The kit includes essential tools like cups, essences, spary bottles, face masks, and more, making it easy to conduct experiments. Experience exceptional service and high-quality science toys for lasting educational enjoyment.\n🚀 Versatile Educational Toy: Whether it's for a science fair or a fun learning activity at home, our girls science kit is a versatile educational toy that offers endless possibilities. It's a classic STEM project that teaches kids about chemistry, and DIY science activities while promoting critical thinking and problem-solving skills. The reusable tools, and materials in the kit allow for multiple experiments, and the learning becomes fun.\n🚀 Unleash Creativity and Imagination: Spark your child's creativity and imagination with our Butterfly Edufields Girls Science Kit from the Super Science Series! As they mix, pour, and observe chemical reactions, they'll develop a deeper understanding of science concepts in a fun and interactive way. Whether experimenting alone or with friends, our kit sparks a lifelong passion for scientific discovery.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Smartivity DIY Music Machine Toy for Kids 8-9-10-11-12-13-14 Years Old I Create Your own Music with 7 Preset Songs - Jingle Bells, Happy Birthday & More I Christmas, Birthday Gift for Girls & Boys",
        "Price": "1,147",
        "About_This_Item": "About this item\nBest Gift For Girls And Boys Ages 8 to 14 Years: Play. Learn. Grow. Learning & education toys for future stars. Science toys with minimal adult involvement. Screen free fun and learning toys for kids. 237 Parts | 120 Mins Build Time | Learn STEAM Concepts around Vibrations and Harmony, Ratched Pawl Mechanism & Gears\nMost Fun Toys In The Market For Boys & Girls: Construction toys with longer gameplays to keep your children engaged. More engaging than any other toy - great birthday gift for girls and boys. Fun gift toys for boys and girls. Fun construction toys for boys and girls of all ages. Innovative versions of popular games, loved by adults, too. Learning & fun rolled into one. More engaging than any other toy in the market.\nBest Screen Free Learning And Educational Toys For Boys & Girls: STEM toys for kids aged 6 - 12 years old. Our toys are backed by science concepts to build lifelong learning skills, and also help in brain and behavioural development. Children learn best through play - our toys for kids 6, 7, 8, 9, 10, 11, 12 years come with real moving parts and mechanical actions to keep your child engaged, and always learning. Zero compromise on fun with our kids' toys.\nEasy To Build And Assemble, Easy To Play And Easy To Learn: DIY, science toys for kids based on STEM concepts. No glue, no tools needed - we use elastic bands for our joining mechanisms to design fun, learning games for kids. Easy to assemble, dismantle and reassemble with our age-apt instructional manuals and videos. Modular assembly structure to help self-paced construction. Extensive assembly, interactions, gameplay and user generated videos on our YouTube channel.\nInternationally-Certified Safe toys for boys & girls, aged 6 - 15 years: Our toys for girls and boys are certified safe in more than 30 countries. Patented & non-toxic toys, tested in international labs. Toys for children which are tested by children and parents, too, at multiple levels of development, along with innumerable testing with Simulated Child-Use Scenarios to ensure long-lasting, multiple play time. No splinters, no sharp ages.\nFree Lifetime Parts Replacement Guarantee: Broken parts or missing parts for your kids’ toy? Something not fitting right? No problem! Just call us and we’ll get your parts replaced - for free, forever.\nMade In India, Internationally-Acclaimed, Award-Winning Toy Brand: Trusted by 6 million parents and children in 33+ countries (USA, Europe, APAC, East & More). Perfect gifts for boys and girls aged 6 years, 7 years, 8 years, 9 years, 10 years and more. We are India’s Global STEAM Toy Brand. Designed by IIT Alumni in collaboration with children. Welcome to the future of play.\nWe Are A Sustainable Brand: Our STEM toys are built with imported pine wood sourced only from responsible, eco-friendly vendors. Sturdy toys, durable and long-lasting. We are child-friendly and planet-friendly, too. Longer constructive activities, multiple levels of gameplay, multi-player interactions and superior engagement.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Smartivity Globe Explorer I AR Based Toy for Kids 8-14 Years Old | 1000+ Facts About Animals, Monuments, Places & More I Birthday Gift for Boys & Girls I DIY STEM Educational Science Toy for Kids",
        "Price": "1,339",
        "About_This_Item": "About this item\nBuild-It-Yourself Globe with a Mechanical Rotator Mechanism, Latitude - Longitude spinners, and 2 dice (Mode of Transport, Number Of Moves).; Screen Free Fun : Longer Constructive Activity,Multiple Gameplays,Core STEAM Learning and Superior Engagement Time Per Rupee than other DIY toys.\nChildren Learn Best Through Play: Smartivity helps in Brain Development of your child with STEAM Concepts based game/toy with Real Moving Parts & MECHANICAL ACTIONS.\nTrusted By Parents, Loved By Children in 24 Countries (incl USA, Europe): Non-Toxic & Safe. Tested in global labs. Exceeds global toy safety standards. India's Global Brand.\nDesigned by IIT Alumni in Collaboration With Children: Evaluated and approved for Construction, STEAM Learning and Fun Quotients by Smartivity STEMNinjas..\nItem Type Name: Globe Trotters Augmented Reality Stem Educational Diy Construction Toy Kit Easy Instructions Experiment Play Learn Science 8+Yrs Free App\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Imagimake Mapology - Isro India'S Space Odyssey|Rocket & Satellite Model Making 1 Piece Sets|Astronaut & Space Toys|Educational Blocks Toy Puzzle - 7+ Years Kids|3D Puzzle Building Set,Multicolor",
        "Price": "1,199",
        "About_This_Item": "About this item\nCELEBRATE THE ACHIEVEMENTS OF ISRO: Imagimake along with the Indian Space Research Organization (ISRO) is excited to teach children about 8 key milestones of India's Space Program - from the first Rocket that we launched to the latest Chandrayaan 2 mission\nROCKETS & SATELLITES MODEL MAKING SETS: This activity set comes with 60 Rocket & Satellite model making pieces to make 4 successfully launched Rockets like RH75, SLV-3, PSLV and GSLV MKIII and Satellites like Aryabhata, Chandrayaan 1, Mangalyaan, the Vikram Lander and the Moon Rover (Pragyan)\nDUAL SIDED PUZZLE: The activity set also includes a dual sided puzzle - one side represents space orbits while the other side of the puzzle represents fun facts like the fact that PSLV rocket created a World Record of putting 104 satellites on a single mission\n\"INFORMATION GUIDE: Alongside the pictorial instructions that help children assemble the models, the guidebook also contains special images captured by ISRO. Box Content - 60 Rocket & Satellite Model Pieces, 13 Dual Sided Puzzle Pieces, 1 Sticker Sheet and 1 Information & Construction Guide\"\nINSPIRING THE FUTURE SPACE SCIENTISTS: There is a so much to learn - what is a Satellite? Why do stages of the rocket detach? The contributions of personalities like Dr APJ Abdul Kalam, Vikram Sarabhai, Kalpana Chawla and lots more\nPROUDLY MADE IN INDIA - Imagimake educational toys for kids are designed and manufactured in India, guaranteeing top-notch quality and craftsmanship while supporting the growth of skilled professionals in the toy manufacturing industry.\nPERFECT GIFT FOR KIDS - Perfect birthday gift for girls and boys aged 5 and above - a space toy that combines playtime with learning about satellites, rockets, and solar systems. This 3D puzzle building set also make excellent birthday gifts for kids, providing a fun and educational experience for all.\nShow More",
        "Product_Description": "N/A"
    },
    {
        "Title": "WitBlox IOT Robotic Science Kit 101+ Projects |Free Online Class |156 Parts| Age 8 9 10 11 12 13 14 |Modular Electronic Sensor & Circuits to Create Logic | Educational Birthday Gift Toys | Boys Girls",
        "Price": "3,599",
        "About_This_Item": "About this item\nWhat You Get: You will get 65 pcs which includes circuit boards like Power Blox to give power to any circuit, a Lamp Blox to give light output, a Buzz Blox to give sound output, and a Motor driver blox to run the motor. Electronics blocks which you can connect to build diy AI based robotics projects. No soldering or programming is required. Easy to plug & play.\nWhat You Learn: WitBlox DIY robotic Kit is a good kit for kids to get started in the field of Robotics. Introducing IOT (Internet of Things) concepts like Home Automation, Controlling things from mobile phones and many more. learn about Design, Mechanisms, and Robotics. The curiosity to learn, mastery, and enthusiasm to build something with electronic circuits. also helps them reduce their screen time and increase their attention span.\nSkill Development: Most preferred educational kit for young developers. The DIY robotic kits help children in evolving Science Exploration, Motor skills, Cognitive Development, logical thinking, Electronics, Programming, Skillfulness, Creativity, Organized and Structuring are all skills that can be developed. Also helps them increase their attention span and problem-solving skills. Children using WitBlox kits show a remarkable decrease in their screen time and an increase in their concentration.\nCompatibility and Warranty: Play with various sensors, light, sound, and motors and build awesome stuff. With the most preferred educational kit for young innovators. Play with various sensors, light, sound, and motors and build awesome stuff. There is 1 year of warranty on all electronic components in the kit.\nRechargeable & Connectivity: You can connect your power bank or mobile charger to the Power blox to get a rechargeable power supply. This helps you keep innovating.\nTutorial: Mobile App for video tutorials of 100+ projects. Mobile App is available for both Android and iOS devices. Designed and developed by IIT-B Alumni to encourage scientific thinking.\nBEST GIFT FOR YOUR KIDS: It's an educational plaything set that is perfect for youths who want to improve their hand-eye coordination and creativity. DIY Robotics Kit is a perfect gift for a birthday, Christmas, Children's Day, or summer camp activities, or it can be a fabulous pick for someone who enjoys DIY. Allow them to become sharper and more intelligent with WitBlox\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "HOTKEI Crystal Growing Science Experiment Kit Games Birthday Gift Toys for Boys Girls Kids Age 8 9 10 12 14 15 Years Old DIY STEM Educational Learning Science Project Kit Box for Kids",
        "Price": "529",
        "About_This_Item": "About this item\nDevelop Your Child's Interest in Science - HOTKEI Crystal Growing Science Kit have hands-on experiments that children can directly participate in. They're a fun way to teach scientific principles while providing a beautiful, tangible result that kids can be proud of.\nSafe & Family-Friendly: Made with safe, non-toxic materials, this DIY science kit is perfect for creating family moments and crafting crystal memories together.\nVersatile Science Activity - Whether it's a fun weekend activity, a unique gift, or a hands-on school project, this kit offers hours of creative learning. Make a perfect Birthday Gift Toys for Boys Girls Kids Age 8 9 10 12 14 15 years old.\nFun & Educational Science Adventure - Spark curiosity with a DIY crystals kit that lets kids learn about science pioneers, crystal structures, and have fun creating vibrant, dazzling crystals to proudly showcase.\nAll Inclusive Science Kit - This comprehensive crystal growing kit includes everything needed for a seamless science adventure. You'll find high-quality crystal-growing powders, tools, containers, and measuring equipments to ensure accurate and safe experiments. A detailed, easy-to-follow instruction manual guides kids step-by-step through the process, making it perfect for beginners allowing young scientists to dive straight into their creative learning journey.\nCrafted with Pride in India : HOTKEI STEM kits are expertly designed and manufactured in India, reflecting quality craftsmanship that parents trust and kids adore.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "shumee Building & Stacking Wooden Fraction Blocks for Ages (5 Years+) | 16 Blocks | Multicolor | Eco Friendly & Non Toxic | 100% Child Safe | Early Math Skills |",
        "Price": "681",
        "About_This_Item": "About this item\nEDUCATIONAL & STACKING BLOCKS: 16 multi-colored wooden blocks with upto 12 dots on them for kids to master fractions. The colors give visual clues. Comes in a cloth bag.\nSUITABLE FOR AGES: 5 years+, Build a city or just do your math with these blocks or do a little of both.\nDIMENSIONS: 23.9 x 18.9 x 8.2 cm\nSKILL SET: Learn maths - teaches addition, subtraction & concepts of 1/2, 1/4, 1/3 and 1/6. Play fraction games, have fun with Math!\nSAFETY AND DURABILITY:Eco-friendly high quality wooden toy painted with non-toxic & child-safe water-based dyes. No batteries no plastic and is ASTM international certified adhering to strict quality control standards.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Shifu Play Plugo Animals Safari Ar-Powered Stem Toy For Kids With Rainforest, Zoo Animal Figurines -Boost Problem-Solving Skills With 3 Games, 100+ Levels, Educational Fun Learning Puzzle (4-10 Years)",
        "Price": "2,973",
        "About_This_Item": "About this item\nPLUGO ANIMALS by PlayShifu is an AR-powered, hands-on kit for children. Join the adventures of the animal kingdom and learn about their calls, food, habitats, and more. Play with real figurines to drive the gameplay on the screen. Watch the video to catch it in action!\nSTEM, STEAM & everything in between - Sharpen your social and emotional intelligence, general knowledge, and creative problem-solving with story-based adventures of the animal kingdom. Think & use the animal figurines to solve puzzles. For ages 4–10.\nPlugo App - This Super Safari Adventure kit works with the Plugo app. Download the free Plugo app to unlock 3 interactive games and 100+ levels with increasing difficulty.\nIN THE BOX - 10 Animal Figurines (alligator, elephant, fox, tiger, gorilla, giraffe, deer, owl, kangaroo, rhinoceros), 1 Figurine Base, 1 Gamepad\nCOMPATIBLE DEVICES - iOS - iPad 5th gen or newer, all models of iPad Pro (except Pro 12.9\"), all models of iPad Air, iPad Mini 2nd gen or newer, iPhone 6 or newer | Android - Samsung devices: 2015 and newer, 2GB RAM and above [Samsung Tab S7, S7 Plus, A 10.5 not supported] | Amazon Fire - 7 HD 2019, Fire 8 HD 2018 and 2020 [Fire 10 not supported]\n› See more product details",
        "Product_Description": "Plugo Animals by PlayShifu - Safari, Rainforest, Zoo Animal Figurines | Educational Puzzles | Gift for Boys & Girls 4-10 Years (Works with iPads, iPhones, Samsung Tablets/Phones, Fire Tablets)"
    },
    {
        "Title": "Bloomingo Shapes and Colours on My Farm : Interactive Puzzle with 20+ Pieces, Matching Cards & Activity Sheet | Fun & Educational STEM Toy for Kids Ages 3+ | Develops Early Math & Cognitive Skills",
        "Price": "539",
        "About_This_Item": "About this item\nShapes & Colors Learning: Engaging shapes and colors farm kit for children aged 2-4\nWhat's in the Box: Includes 12 double-sided shape puzzles, 12 shape tokens, and 3 engaging worksheets.\nInteractive Play: Encourages sorting, matching, and pretend play on the farm.\nSkill Enhancement: Improves pattern recognition, hand-eye coordination, and problem-solving skills.\nEducational Fun: Combines learning with imaginative play for a holistic experience.\nGreat Gift: Perfect gift for birthdays, holidays, and other special occasions.\nSkill Building: Boosts memory, problem-solving, and strategic thinking skills.\n› See more product details",
        "Product_Description": "N/A"
    },
    {
        "Title": "Spartan Kids 42 Animal Flash Cards | Augmented Reality Based Flash Cards for Kids",
        "Price": "145",
        "About_This_Item": "About this item\nWhat you get: 42 Augmented Reality Flash cards ( 35 Animals Cards + 6 Food Cards + 1 Instructions Card ) that operate in real-time with the specially built Play Animal AR 3D Safari Android/iOS App. Also, the set contains device stand, with Introduction and activation code.\nWhat it brings home: A real life experience of animals in their voice distinctive sounds they make and their unique actions. It is bound to bring a smile on your child’s face!\nSTEAM ahead - a perfect toy for the ever-curious kids that allows you to scan printed animal cards and animals come alive in front of your eyes Ãƒâ€šÃ‚Â Makes for an amazing and unique gift for kids!.\nAnimal Flash cards app takes your child on an augmented reality based journey around the world\nPlayful Animation : All Augmented Reality Flash cards come with animation and sound association, creation audio visual aids to commit to the child's memory.\n› See more product details",
        "Product_Description": "N/A"
    }
]