[
    {
        "Title": "Imagimake Mapology - Isro India'S Space Odyssey|Rocket & Satellite Model Making 1 Piece Sets|Astronaut & Space Toys|Educational Blocks Toy Puzzle - 7+ Years Kids|3D Puzzle Building Set,Multicolor",
        "Price": "1,199",
        "About_this_Item": "About this item\nCELEBRATE THE ACHIEVEMENTS OF ISRO: Imagimake along with the Indian Space Research Organization (ISRO) is excited to teach children about 8 key milestones of India's Space Program - from the first Rocket that we launched to the latest Chandrayaan 2 mission\nROCKETS & SATELLITES MODEL MAKING SETS: This activity set comes with 60 Rocket & Satellite model making pieces to make 4 successfully launched Rockets like RH75, SLV-3, PSLV and GSLV MKIII and Satellites like Aryabhata, Chandrayaan 1, Mangalyaan, the Vikram Lander and the Moon Rover (Pragyan)\nDUAL SIDED PUZZLE: The activity set also includes a dual sided puzzle - one side represents space orbits while the other side of the puzzle represents fun facts like the fact that PSLV rocket created a World Record of putting 104 satellites on a single mission\n\"INFORMATION GUIDE: Alongside the pictorial instructions that help children assemble the models, the guidebook also contains special images captured by ISRO. Box Content - 60 Rocket & Satellite Model Pieces, 13 Dual Sided Puzzle Pieces, 1 Sticker Sheet and 1 Information & Construction Guide\"\nINSPIRING THE FUTURE SPACE SCIENTISTS: There is a so much to learn - what is a Satellite? Why do stages of the rocket detach? The contributions of personalities like Dr APJ Abdul Kalam, Vikram Sarabhai, Kalpana Chawla and lots more\nPROUDLY MADE IN INDIA - Imagimake educational toys for kids are designed and manufactured in India, guaranteeing top-notch quality and craftsmanship while supporting the growth of skilled professionals in the toy manufacturing industry.\nPERFECT GIFT FOR KIDS - Perfect birthday gift for girls and boys aged 5 and above - a space toy that combines playtime with learning about satellites, rockets, and solar systems. This 3D puzzle building set also make excellent birthday gifts for kids, providing a fun and educational experience for all.\nShow More",
        "Product_Description": "Product Description"
    },
    {
        "Title": "Imagimake Mapology ISRO Space Toys: Mission Suryayaan Aditya L1 | Rocket Model & Satellite | Educational Toys for 5+ Years | 3D Puzzles With Rocket Launcher | Birthday Gift for Kids",
        "Price": "499",
        "About_this_Item": "About this item\nINDIA'S FIRST MISSION TO SUN: Explore the wonders of space with Mission Suryayaan Aditya L1. This space explorer kit allows kids to build and explore the PSLV XL rocket and Aditya L1 satellite, replicating the excitement of a real space mission.\nENGAGING PLAY PATTERNS: Experience three unique play patterns, Begin by crafting realistic 3D models. Next, feel the rush of launching a rocket using an enjoyable and simple rocket launcher mechanism. Once the rocket has taken off, participate in satellite navigation by expertly guiding the magnetic satellite along the trajectory, simulating a trip to the destination.\nEDUCATIONAL CONTENT: The comprehensive information and construction guide not only assists in assembling the PSLV rocket model and satellite but also educates users with exclusive ISRO images of the launch. Learn about the vital instruments with Aditya L1 to study the Sun and gain insights into the significance of studying our nearest star.\nINSPIRING CURIOSITY: Encourage critical thinking as children explore the Aditya L1 model, unraveling answers to fundamental questions such as why we study the Sun, the importance of venturing into space for solar studies, how the Aditya L1 satellite model is designed for this mission, and where in space scientists need to go for studying the Sun.\nCOMPREHENSIVE ASSEMBLY GUIDE: The included instruction manual outlines step-by-step assembly instructions for the Aditya l1 rocket models and provides a wealth of information about the mission. Immerse yourself in the fascinating world of space exploration with this engaging and educational kit. Unleash the excitement with 50+ pieces, including satellite and 19 rocket model pieces, 21 plastic joint pieces, 1 rocket launcher, 1 magnetic slider, and an informative construction guide.\nCRAFTING SKILLS FOR A STELLAR FUTURE: Mission Suryayaan Aditya L1 isn't just about exploring space - it's a skill-building journey! Engage in intricate 3D modelling, tackle assembly challenges for problem-solving prowess, and cultivate creativity, teamwork, and scientific curiosity. Build, play, and pave the way for a future filled with stellar skills!\nUNLEASH THE GIFT OF EXPLORATION: Elevate the joy of gifting space toys, a captivating space adventure that combines fun and education. Perfect for aspiring young astronauts, this set inspires curiosity and imaginative play, making it an ideal birthday gift for boys, holidays, or any occasion. Give the gift of discovery and watch as young minds embark on an exciting journey through the wonders of space exploration.\nShow More",
        "Product_Description": "Product Description"
    },
    {
        "Title": "Imagimake Mapology Ultimate Combo: India & World Map Puzzle, Solar System Puzzle & Monument of India Construstion Set - Educational Toy for Kids Above 5 Years",
        "Price": "2,349",
        "About_this_Item": "About this item\nbp 1- THE ULTIMATE COMBO KIT: This combo kit is a huge hit among kids as it comes with 2 map puzzle- India and World, Solar System dual side puzzle and Monuments of India construction set. An inspiring gift to encourage creativity and learning in kids.\nbp 2- COUNTRY AND STATE SHAPED PUZZLE PIECES: The map puzzle pieces are cut in the actual shapes of the countries and states. This helps children understand the shape & relative sizes of the different countries and states as they put the pieces together to snugly fit with one another and form the India and World map.\nbp 3- 122+ INTERESTING FACTS TO LEARN: Which is the oldest monument of India? Which is the coldest planet of Solar System? Learn about Indian monuments or colour, size, rotation, dwarf planets, the asteroid belt and lots more.\nbp 4- DUAL SIDED PUZZLE WITH PLANET & ORBIT SHAPED PUZZLE PIECES: The unique Solar System puzzle comes with perfectly cut Planets & Orbit shaped puzzle pieces to make play-way learning effortless and fun!; BUILD 10 HERITAGE MONUMENTS: Enjoy a journey through time as kids build 10 of the greatest monuments of Indian history like Taj Mahal, India Gate and Qutub Minar in this construction set\nbp 5- Target Gender: Unisex\n› See more product details",
        "Product_Description": "Product Description\nMapology is a perfect learning aid that helps children explore the world around them, express their creativity and enjoy every second of play!\nClick to play video\nThe Ultimate Educational Combo Kit\nThis kit is designed for kids to make learning more fun & at the same time keep them constructively engaged while they explore the world around them\n1\n2\n3\nSocial Confidence\nGame play experiences with peers give an opportunity to collaborate, communicate, share and grow\nSelf-Development Skills Motor skills Fun Family Playtime\nWhy Mapology?\nWhy do children love Mapology?\nWhat makes Mapology a preferred choice among parents?"
    },
    {
        "Title": "Imagimake Clay Stickers: Princess | Create 3 Unique DIY Stickers Using Air Dry Clay | No Mess, Travel-Friendly | Return Gifts | Birthday Gifts for Kids Ages 3,4,5,6,7,8, Multicolor",
        "Price": "299",
        "About_this_Item": "About this item\nLOOK WHAT I MADE: Unleash your child's creativity with fun & easy DIY Art & Craft Kit, designed for making clay stickers. It's an exciting way for them to craft unique art using air dry foam clay\nCOMPLETE KIT: This DIY kit includes 6 Clay Stickers and 12 Foam Clay Pouches (8gm each), providing plenty of material for multiple crafting sessions.\nFILL, PEEL & STICK: Simply fill the special Air Dry Clay within the sticker outlines and let it dry for 2-3 hours. Once completely dried, peel off the sticker, & stick onto any smooth surface like windows, mirrors or tiles. It's that easy for a 3 year old\nVIBRANT CLAY COLORS: This high-quality clay for kids comes with 6 bright colours that kids can use to make colourful art. And guess what? They can mix multiple colours together to make a brand-new colour, giving them even more ways to make cool stuff!\nMESS-FREE & NON-TOXIC: Our clay is both mess-free and non-toxic, ensuring a safe and enjoyable creative experience for kids. It's easy to use, making it perfect for children to express their creativity hassle-free.\nUSAGE INSTRUCTION: The air dry clay pouch once opened will dry out in few hours once the seal pack is opened. If needed, it can be kept in an airtight container for up to 48 hours for future use.\nTRAVEL FRIENDLY: Keep little hands busy during travel with our convenient to pack and carry along activity kit. It's perfect for long car rides, flights, or train journeys, providing hours of engaging entertainment.\nShow More",
        "Product_Description": "From the brand\nBest Sellers\nVisit the Store\nShark's Choice\nVisit the Store\nCelebrate India\nVisit the Store"
    },
    {
        "Title": "Imagimake Man's Journey to Moon | Mission Apollo 11 | Rocket & Satellite Model Making Set | 3D Puzzle Toy for Kids | Astronaut & Space Kit | Birthday Gift for Girls & Boys Ages 8,9,10,11,12,13",
        "Price": "999",
        "About_this_Item": "About this item\nNASA's MISSION TO THE MOON: Imagimake inspired by NASA are excited to teach children about Man's Journey to the Moon. This space toy model-making kit features 5 models: 1 Rocket & 4 Spacecraft modules\nWHAT YOU GET: This astronaut toy includes 37 Rocket & Satellite Model Pieces, 45 Plastic Joint Pieces, 1 Magnetic Mission Control Centre, 12 Mission Step Sheets, 12 Magnetic Model & Astronaut Pieces, 1 Information & Construction Guide\nINTERCHANGE & PLAY: Spacecraft modules can be interchanged. This feature allows children to explore & learn different configurations as per the mission. Also, Kids can put magnetic astronauts on red stars, just like where real astronauts sit to go into space on a rocket & satellite.\nENACT THE JOURNEY WITH MISSION CONTROL CENTER: Experience the historic journey of Apollo 11, from launch to touchdown on the moon surface, with 12 step sheets. The kit includes 4 magnetic spacecraft pieces which kids can assemble on the Mission Control Center for a realistic understanding of the Apollo 11 mission.\nCELEBRATE THE LANDING: Display the completed models on the back side of the mission control center. With stickers and foam, kids can setup a moon landscape featuring astronauts and flags for a stunning visual representation of the historic moon landing.\n› See more product details",
        "Product_Description": "Product Description"
    },
    {
        "Title": "Imagimake Paper Scissor Skills | Cut, Fold & Paste | Educational Toys For Kids 3+ Years | Montessori Toys | Develop Fine Motor Skills | Gift For 3 Year Old Boys & Girls, Multicolour",
        "Price": "549",
        "About_this_Item": "About this item\nCUT, FOLD & PASTE: A great way for preschoolers to start developing their scissor skills by cutting lines and shapes. This box includes child safety scissor with spring feature for easy cutting, a folding board to assist beginners to fold and a glue stick for a mess free play\nBOOK WITH 25 ACTIVITIES: This preschool learning toys includes 25 different activities with 3 levels which starts with Clay to Mosaics to 3D with 25 fantastic themes which includes Dinoland, Letter from my trip, Circus Dancer, Popsicle Mosaic, Ice Cream and so on\nFIRST TIME EVER BEGINNER'S FOLDING BOARD: The beginner's folding board has been specially designed after studying 100+ kids fold paper. Folding board helps to get better alignment & hence a neater fold\nHOLISTIC PRESCHOOL LEARNING KIT: Learning made fun as this montessori toys for 3+ year old kids cover different topics while playing. Kids can learn about the popular themes like Professions, Vegetables, Fruits, Space, Farm Animals, Video Calling and much more\nSKILL BUILDING SET: This learning toys for 3 year old activity set helps to develop Fine Motor Skills, Cognitive Skills, Hand-Eye Coordination, Brain Development, Pencil Control & Pre-Writing Skills, Concentration and much more\n› See more product details",
        "Product_Description": "Product Description"
    },
    {
        "Title": "N/A",
        "Price": "N/A",
        "About_this_Item": "N/A",
        "Product_Description": "N/A"
    }
]